In [2]:
import pandas as pd
import numpy as np

In [14]:
s1 = pd.Series(np.random.randn(5))
s2 = pd.Series(np.random.randn(5))

In [21]:
# series to a df
df2 = s2.to_frame()
df2

          0
0 -0.294142
1 -0.878958
2  0.229444
3  1.605702
4 -1.863001

In [15]:
# concatinate 2 series and create a dataFrame
df = pd.concat([s1, s2])
df

0   -1.331550
1   -0.407650
2   -1.162145
3   -2.660440
4    0.556436
0   -0.294142
1   -0.878958
2    0.229444
3    1.605702
4   -1.863001
dtype: float64

In [16]:
df = pd.concat([s1,s2], axis = 1)
df

          0         1
0 -1.331550 -0.294142
1 -0.407650 -0.878958
2 -1.162145  0.229444
3 -2.660440  1.605702
4  0.556436 -1.863001

In [18]:
# change name of cols
df.columns = ['col1', 'col2']
df

       col1      col2
0 -1.331550 -0.294142
1 -0.407650 -0.878958
2 -1.162145  0.229444
3 -2.660440  1.605702
4  0.556436 -1.863001

In [20]:
# get the first row
df.iloc[0]

col1   -1.331550
col2   -0.294142
Name: 0, dtype: float64